package main

/*
Краткое описание:
	Состояние — это поведенческий паттерн проектирования,
	который позволяет объектам менять поведение в зависимости от своего состояния.
	Извне создаётся впечатление, что изменился класс объекта.
Плюсы:
	1. Избавляет от множества больших условных операторов машины состояний.
	2. Концентрирует в одном месте код, связанный с определённым состоянием.
	3. Упрощает код контекста.
Минусы:
	1. Может неоправданно усложнить код, если состояний мало и они редко меняются.
*/
